{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}D:\Sony\Econometrics\AdvEcon\Exercise6\Exercise6.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}29 Nov 2016, 11:06:30
{txt}
{com}. infile id  pyears    prftshr   choice    female    married   age  educ finc25    finc35    finc50    finc75    finc100   finc101   wealth89  black stckin89  irain89   pctstck   using "pension.raw", clear 
{txt}(194 observations read)

{com}. 
. label var id                                                            "family identifier"
{txt}
{com}. label var pyears                            "years in pension plan"
{txt}
{com}. label var prftshr                           "=1 if profit sharing plan"
{txt}
{com}. label var choice                            "=1 if can choose method invest"
{txt}
{com}. label var female                            "=1 if female"
{txt}
{com}. label var married                           "=1 if married"
{txt}
{com}. label var age                               "age in years"
{txt}
{com}. label var educ                              "highest grade completed"
{txt}
{com}. label var finc25                            "$15,000 < faminc92 <= $25,000"
{txt}
{com}. label var finc35                            "$25,000 < faminc92 <= $35,000"
{txt}
{com}. label var finc50                            "$35,000 < faminc92 <= $50,000"
{txt}
{com}. label var finc75                            "$50,000 < faminc92 <= $75,000"
{txt}
{com}. label var finc100                           "$75,000 < faminc92 <= $100,000"
{txt}
{com}. label var finc101                           "$100,000 < faminc92"
{txt}
{com}. label var wealth89                          "net worth, 1989, $1000"
{txt}
{com}. label var black                             "=1 if black"
{txt}
{com}. label var stckin89                          "=1 if owned stock in 1989"
{txt}
{com}. label var irain89                           "=1 if had IRA in 1989"
{txt}
{com}. label var pctstck                           "0=mstbnds,50=mixed,100=mststcks"
{txt}
{com}. 
. * (A)Estimate an ordered probit model for pctstk, where the explanatory variables are as identified above.
. oprobit pctstck choice age educ female black married finc* wealth89 prftshr, nolog
{res}
{txt}Ordered probit regression{col 49}Number of obs{col 67}= {res}       194
{txt}{col 49}LR chi2({res}14{txt}){col 67}= {res}     20.77
{txt}{col 49}Prob > chi2{col 67}= {res}    0.1077
{txt}Log likelihood = {res} -201.9865{txt}{col 49}Pseudo R2{col 67}= {res}    0.0489

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     pctstck{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}choice {c |}{col 14}{res}{space 2}  .371171{col 26}{space 2} .1841121{col 37}{space 1}    2.02{col 46}{space 3}0.044{col 54}{space 4}  .010318{col 67}{space 3} .7320241
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0500516{col 26}{space 2} .0226063{col 37}{space 1}   -2.21{col 46}{space 3}0.027{col 54}{space 4}-.0943591{col 67}{space 3} -.005744
{txt}{space 8}educ {c |}{col 14}{res}{space 2} .0261382{col 26}{space 2} .0352561{col 37}{space 1}    0.74{col 46}{space 3}0.458{col 54}{space 4}-.0429626{col 67}{space 3} .0952389
{txt}{space 6}female {c |}{col 14}{res}{space 2} .0455642{col 26}{space 2}  .206004{col 37}{space 1}    0.22{col 46}{space 3}0.825{col 54}{space 4}-.3581963{col 67}{space 3} .4493246
{txt}{space 7}black {c |}{col 14}{res}{space 2} .0933923{col 26}{space 2} .2820403{col 37}{space 1}    0.33{col 46}{space 3}0.741{col 54}{space 4}-.4593965{col 67}{space 3} .6461811
{txt}{space 5}married {c |}{col 14}{res}{space 2} .0935981{col 26}{space 2} .2332114{col 37}{space 1}    0.40{col 46}{space 3}0.688{col 54}{space 4}-.3634878{col 67}{space 3}  .550684
{txt}{space 6}finc25 {c |}{col 14}{res}{space 2}-.5784299{col 26}{space 2}  .423162{col 37}{space 1}   -1.37{col 46}{space 3}0.172{col 54}{space 4}-1.407812{col 67}{space 3} .2509524
{txt}{space 6}finc35 {c |}{col 14}{res}{space 2}-.1346721{col 26}{space 2} .4305242{col 37}{space 1}   -0.31{col 46}{space 3}0.754{col 54}{space 4}-.9784841{col 67}{space 3} .7091399
{txt}{space 6}finc50 {c |}{col 14}{res}{space 2}-.2620401{col 26}{space 2} .4265936{col 37}{space 1}   -0.61{col 46}{space 3}0.539{col 54}{space 4}-1.098148{col 67}{space 3} .5740681
{txt}{space 6}finc75 {c |}{col 14}{res}{space 2}-.5662312{col 26}{space 2} .4780035{col 37}{space 1}   -1.18{col 46}{space 3}0.236{col 54}{space 4}-1.503101{col 67}{space 3} .3706385
{txt}{space 5}finc100 {c |}{col 14}{res}{space 2}-.2278963{col 26}{space 2} .4685942{col 37}{space 1}   -0.49{col 46}{space 3}0.627{col 54}{space 4}-1.146324{col 67}{space 3} .6905316
{txt}{space 5}finc101 {c |}{col 14}{res}{space 2}-.8641109{col 26}{space 2} .5291111{col 37}{space 1}   -1.63{col 46}{space 3}0.102{col 54}{space 4} -1.90115{col 67}{space 3} .1729279
{txt}{space 4}wealth89 {c |}{col 14}{res}{space 2}-.0000956{col 26}{space 2} .0003737{col 37}{space 1}   -0.26{col 46}{space 3}0.798{col 54}{space 4}-.0008279{col 67}{space 3} .0006368
{txt}{space 5}prftshr {c |}{col 14}{res}{space 2} .4817182{col 26}{space 2} .2161233{col 37}{space 1}    2.23{col 46}{space 3}0.026{col 54}{space 4} .0581243{col 67}{space 3}  .905312
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
       /cut1 {c |}{col 14}{res}{space 2}-3.087373{col 26}{space 2} 1.623765{col 54}{space 4}-6.269894{col 67}{space 3} .0951479
{txt}       /cut2 {c |}{col 14}{res}{space 2}-2.053553{col 26}{space 2} 1.618611{col 54}{space 4}-5.225972{col 67}{space 3} 1.118865
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. estimates store oprobit1 
{txt}
{com}. outreg2 using oprobit1_table, title(Ordered probit model for pctstk) word replace
{txt}{stata `"shellout using `"oprobit1_table.rtf"'"':oprobit1_table.rtf}
{browse `"D:\Sony\Econometrics\AdvEcon\Exercise6"' :dir}{com} : {txt}{stata `"seeout using "oprobit1_table.txt""':seeout}

{com}. 
. * (B) With heteroskedasticity-robust to cluster correlation within family
. oprobit pctstck choice age educ female black married finc* wealth89 prftshr, nolog vce(cluster id) 
{res}
{txt}Ordered probit regression{col 49}Number of obs{col 67}= {res}       194
{txt}{col 49}Wald chi2({res}14{txt}){col 67}= {res}     25.06
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0340
{txt}Log pseudolikelihood = {res} -201.9865{txt}{col 49}Pseudo R2{col 67}= {res}    0.0489

{txt}{ralign 78:(Std. Err. adjusted for {res:171} clusters in id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     pctstck{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}choice {c |}{col 14}{res}{space 2}  .371171{col 26}{space 2}  .182698{col 37}{space 1}    2.03{col 46}{space 3}0.042{col 54}{space 4} .0130896{col 67}{space 3} .7292525
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0500516{col 26}{space 2} .0242462{col 37}{space 1}   -2.06{col 46}{space 3}0.039{col 54}{space 4}-.0975733{col 67}{space 3}-.0025299
{txt}{space 8}educ {c |}{col 14}{res}{space 2} .0261382{col 26}{space 2} .0351353{col 37}{space 1}    0.74{col 46}{space 3}0.457{col 54}{space 4}-.0427258{col 67}{space 3} .0950021
{txt}{space 6}female {c |}{col 14}{res}{space 2} .0455642{col 26}{space 2} .2000286{col 37}{space 1}    0.23{col 46}{space 3}0.820{col 54}{space 4}-.3464848{col 67}{space 3} .4376131
{txt}{space 7}black {c |}{col 14}{res}{space 2} .0933923{col 26}{space 2}  .252677{col 37}{space 1}    0.37{col 46}{space 3}0.712{col 54}{space 4}-.4018455{col 67}{space 3} .5886301
{txt}{space 5}married {c |}{col 14}{res}{space 2} .0935981{col 26}{space 2} .2546688{col 37}{space 1}    0.37{col 46}{space 3}0.713{col 54}{space 4}-.4055436{col 67}{space 3} .5927398
{txt}{space 6}finc25 {c |}{col 14}{res}{space 2}-.5784299{col 26}{space 2} .5239993{col 37}{space 1}   -1.10{col 46}{space 3}0.270{col 54}{space 4} -1.60545{col 67}{space 3} .4485899
{txt}{space 6}finc35 {c |}{col 14}{res}{space 2}-.1346721{col 26}{space 2} .4998878{col 37}{space 1}   -0.27{col 46}{space 3}0.788{col 54}{space 4}-1.114434{col 67}{space 3} .8450899
{txt}{space 6}finc50 {c |}{col 14}{res}{space 2}-.2620401{col 26}{space 2} .4960936{col 37}{space 1}   -0.53{col 46}{space 3}0.597{col 54}{space 4}-1.234366{col 67}{space 3} .7102856
{txt}{space 6}finc75 {c |}{col 14}{res}{space 2}-.5662312{col 26}{space 2} .5389199{col 37}{space 1}   -1.05{col 46}{space 3}0.293{col 54}{space 4}-1.622495{col 67}{space 3} .4900325
{txt}{space 5}finc100 {c |}{col 14}{res}{space 2}-.2278963{col 26}{space 2} .5337036{col 37}{space 1}   -0.43{col 46}{space 3}0.669{col 54}{space 4}-1.273936{col 67}{space 3} .8181435
{txt}{space 5}finc101 {c |}{col 14}{res}{space 2}-.8641109{col 26}{space 2} .5387136{col 37}{space 1}   -1.60{col 46}{space 3}0.109{col 54}{space 4} -1.91997{col 67}{space 3} .1917484
{txt}{space 4}wealth89 {c |}{col 14}{res}{space 2}-.0000956{col 26}{space 2} .0003743{col 37}{space 1}   -0.26{col 46}{space 3}0.798{col 54}{space 4}-.0008291{col 67}{space 3}  .000638
{txt}{space 5}prftshr {c |}{col 14}{res}{space 2} .4817182{col 26}{space 2} .2507571{col 37}{space 1}    1.92{col 46}{space 3}0.055{col 54}{space 4}-.0097567{col 67}{space 3}  .973193
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
       /cut1 {c |}{col 14}{res}{space 2}-3.087373{col 26}{space 2} 1.723981{col 54}{space 4}-6.466315{col 67}{space 3} .2915686
{txt}       /cut2 {c |}{col 14}{res}{space 2}-2.053553{col 26}{space 2} 1.713553{col 54}{space 4}-5.412056{col 67}{space 3}  1.30495
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. outreg2 using oprobit1_table2, title(Ordered probit model for pctstk with heteroskedasticity-robust to cluster correlation within family) word replace
{txt}{stata `"shellout using `"oprobit1_table2.rtf"'"':oprobit1_table2.rtf}
{browse `"D:\Sony\Econometrics\AdvEcon\Exercise6"' :dir}{com} : {txt}{stata `"seeout using "oprobit1_table2.txt""':seeout}

{com}. 
. *With heteroskedasticity-robust standard errors
. oprobit pctstck choice age educ female black married finc* wealth89 prftshr, nolog vce(robust) 
{res}
{txt}Ordered probit regression{col 49}Number of obs{col 67}= {res}       194
{txt}{col 49}Wald chi2({res}14{txt}){col 67}= {res}     25.32
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0315
{txt}Log pseudolikelihood = {res} -201.9865{txt}{col 49}Pseudo R2{col 67}= {res}    0.0489

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     pctstck{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}choice {c |}{col 14}{res}{space 2}  .371171{col 26}{space 2} .1777561{col 37}{space 1}    2.09{col 46}{space 3}0.037{col 54}{space 4} .0227754{col 67}{space 3} .7195666
{txt}{space 9}age {c |}{col 14}{res}{space 2}-.0500516{col 26}{space 2}  .024625{col 37}{space 1}   -2.03{col 46}{space 3}0.042{col 54}{space 4}-.0983156{col 67}{space 3}-.0017876
{txt}{space 8}educ {c |}{col 14}{res}{space 2} .0261382{col 26}{space 2} .0349858{col 37}{space 1}    0.75{col 46}{space 3}0.455{col 54}{space 4}-.0424328{col 67}{space 3} .0947091
{txt}{space 6}female {c |}{col 14}{res}{space 2} .0455642{col 26}{space 2} .2046529{col 37}{space 1}    0.22{col 46}{space 3}0.824{col 54}{space 4}-.3555482{col 67}{space 3} .4466765
{txt}{space 7}black {c |}{col 14}{res}{space 2} .0933923{col 26}{space 2}  .260261{col 37}{space 1}    0.36{col 46}{space 3}0.720{col 54}{space 4}-.4167099{col 67}{space 3} .6034945
{txt}{space 5}married {c |}{col 14}{res}{space 2} .0935981{col 26}{space 2} .2469335{col 37}{space 1}    0.38{col 46}{space 3}0.705{col 54}{space 4}-.3903826{col 67}{space 3} .5775788
{txt}{space 6}finc25 {c |}{col 14}{res}{space 2}-.5784299{col 26}{space 2} .4954707{col 37}{space 1}   -1.17{col 46}{space 3}0.243{col 54}{space 4}-1.549535{col 67}{space 3} .3926749
{txt}{space 6}finc35 {c |}{col 14}{res}{space 2}-.1346721{col 26}{space 2} .4861239{col 37}{space 1}   -0.28{col 46}{space 3}0.782{col 54}{space 4}-1.087457{col 67}{space 3} .8181132
{txt}{space 6}finc50 {c |}{col 14}{res}{space 2}-.2620401{col 26}{space 2} .4754706{col 37}{space 1}   -0.55{col 46}{space 3}0.582{col 54}{space 4}-1.193945{col 67}{space 3} .6698653
{txt}{space 6}finc75 {c |}{col 14}{res}{space 2}-.5662312{col 26}{space 2} .5155575{col 37}{space 1}   -1.10{col 46}{space 3}0.272{col 54}{space 4}-1.576705{col 67}{space 3}  .444243
{txt}{space 5}finc100 {c |}{col 14}{res}{space 2}-.2278963{col 26}{space 2} .5148156{col 37}{space 1}   -0.44{col 46}{space 3}0.658{col 54}{space 4}-1.236916{col 67}{space 3} .7811237
{txt}{space 5}finc101 {c |}{col 14}{res}{space 2}-.8641109{col 26}{space 2} .5178841{col 37}{space 1}   -1.67{col 46}{space 3}0.095{col 54}{space 4}-1.879145{col 67}{space 3} .1509233
{txt}{space 4}wealth89 {c |}{col 14}{res}{space 2}-.0000956{col 26}{space 2} .0003586{col 37}{space 1}   -0.27{col 46}{space 3}0.790{col 54}{space 4}-.0007983{col 67}{space 3} .0006072
{txt}{space 5}prftshr {c |}{col 14}{res}{space 2} .4817182{col 26}{space 2} .2437364{col 37}{space 1}    1.98{col 46}{space 3}0.048{col 54}{space 4} .0040037{col 67}{space 3} .9594326
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
       /cut1 {c |}{col 14}{res}{space 2}-3.087373{col 26}{space 2} 1.737134{col 54}{space 4}-6.492093{col 67}{space 3} .3173472
{txt}       /cut2 {c |}{col 14}{res}{space 2}-2.053553{col 26}{space 2} 1.728599{col 54}{space 4}-5.441544{col 67}{space 3} 1.334437
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. outreg2 using oprobit1_table3, title(Ordered probit model with heteroskedasticity-robust standard errors) word replace
{txt}{stata `"shellout using `"oprobit1_table3.rtf"'"':oprobit1_table3.rtf}
{browse `"D:\Sony\Econometrics\AdvEcon\Exercise6"' :dir}{com} : {txt}{stata `"seeout using "oprobit1_table3.txt""':seeout}

{com}. 
. *(C) Obtain the estimated average marginal effects of choice on probabilities of asset allocation in defined contribution plans. Interpret the results.
. margins, dydx(choice) post
{res}
{txt}Average marginal effects{col 49}Number of obs{col 67}= {res}       194
{txt}Model VCE{col 14}: {res}Robust

{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:choice}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:1._predict}:{space 1}{res:Pr(pctstck==0), predict(pr outcome(0))}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:2._predict}:{space 1}{res:Pr(pctstck==50), predict(pr outcome(50))}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:3._predict}:{space 1}{res:Pr(pctstck==100), predict(pr outcome(100))}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}choice       {txt}{c |}
{space 4}_predict {c |}
{space 10}1  {c |}{col 14}{res}{space 2}-.1255342{col 26}{space 2}  .059416{col 37}{space 1}   -2.11{col 46}{space 3}0.035{col 54}{space 4}-.2419874{col 67}{space 3} -.009081
{txt}{space 10}2  {c |}{col 14}{res}{space 2} .0052252{col 26}{space 2} .0094579{col 37}{space 1}    0.55{col 46}{space 3}0.581{col 54}{space 4}-.0133119{col 67}{space 3} .0237622
{txt}{space 10}3  {c |}{col 14}{res}{space 2}  .120309{col 26}{space 2} .0569061{col 37}{space 1}    2.11{col 46}{space 3}0.035{col 54}{space 4} .0087751{col 67}{space 3} .2318429
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. *(D) Estimate the marginal effect of choice on probabilities of asset allocation in defined contribution
. estimates restore oprobit1
{txt}(results {stata estimates replay oprobit1:oprobit1} are active now)

{com}. margins, dydx(choice) at (married=0 female=1 black=1 age=60 educ=12 wealth89=150 finc50=1) post
{res}
{txt}Average marginal effects{col 49}Number of obs{col 67}= {res}       194
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:choice}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:1._predict}:{space 1}{res:Pr(pctstck==0), predict(pr outcome(0))}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:2._predict}:{space 1}{res:Pr(pctstck==50), predict(pr outcome(50))}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:3._predict}:{space 1}{res:Pr(pctstck==100), predict(pr outcome(100))}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:at}:{space 1}{res:{txt:age}{space 13}{txt:=} {space 9}60}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:educ}{space 12}{txt:=} {space 9}12}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:female}{space 10}{txt:=} {space 10}1}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:black}{space 11}{txt:=} {space 10}1}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:married}{space 9}{txt:=} {space 10}0}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:finc50}{space 10}{txt:=} {space 10}1}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:wealth89}{space 8}{txt:=} {space 8}150}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}choice       {txt}{c |}
{space 4}_predict {c |}
{space 10}1  {c |}{col 14}{res}{space 2}-.1343462{col 26}{space 2} .0650534{col 37}{space 1}   -2.07{col 46}{space 3}0.039{col 54}{space 4}-.2618484{col 67}{space 3}-.0068439
{txt}{space 10}2  {c |}{col 14}{res}{space 2} .0255342{col 26}{space 2} .0501028{col 37}{space 1}    0.51{col 46}{space 3}0.610{col 54}{space 4}-.0726655{col 67}{space 3} .1237338
{txt}{space 10}3  {c |}{col 14}{res}{space 2}  .108812{col 26}{space 2} .0668719{col 37}{space 1}    1.63{col 46}{space 3}0.104{col 54}{space 4}-.0222545{col 67}{space 3} .2398785
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. * (E) Expected value
. * Then the mean value when choice =1
. estimates restore oprobit1
{txt}(results {stata estimates replay oprobit1:oprobit1} are active now)

{com}. margins, at (choice=1 married=0 female=1 black=1 age=60 educ=12 wealth89=150 finc50=1) predict(outcome(#1))
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}       194
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(pctstck==0), predict(outcome(#1))}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:at}:{space 1}{res:{txt:choice}{space 10}{txt:=} {space 10}1}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:age}{space 13}{txt:=} {space 9}60}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:educ}{space 12}{txt:=} {space 9}12}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:female}{space 10}{txt:=} {space 10}1}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:black}{space 11}{txt:=} {space 10}1}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:married}{space 9}{txt:=} {space 10}0}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:finc50}{space 10}{txt:=} {space 10}1}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:wealth89}{space 8}{txt:=} {space 8}150}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}     Margin{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} .3425539{col 26}{space 2} .1757892{col 37}{space 1}    1.95{col 46}{space 3}0.051{col 54}{space 4}-.0019866{col 67}{space 3} .6870944
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. margins, at (choice=1 married=0 female=1 black=1 age=60 educ=12 wealth89=150 finc50=1) predict(outcome(#2))
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}       194
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(pctstck==50), predict(outcome(#2))}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:at}:{space 1}{res:{txt:choice}{space 10}{txt:=} {space 10}1}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:age}{space 13}{txt:=} {space 9}60}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:educ}{space 12}{txt:=} {space 9}12}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:female}{space 10}{txt:=} {space 10}1}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:black}{space 11}{txt:=} {space 10}1}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:married}{space 9}{txt:=} {space 10}0}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:finc50}{space 10}{txt:=} {space 10}1}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:wealth89}{space 8}{txt:=} {space 8}150}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}     Margin{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} .3742912{col 26}{space 2} .0415856{col 37}{space 1}    9.00{col 46}{space 3}0.000{col 54}{space 4} .2927849{col 67}{space 3} .4557975
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. margins, at (choice=1 married=0 female=1 black=1 age=60 educ=12 wealth89=150 finc50=1) predict(outcome(#3))
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}       194
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(pctstck==100), predict(outcome(#3))}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:at}:{space 1}{res:{txt:choice}{space 10}{txt:=} {space 10}1}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:age}{space 13}{txt:=} {space 9}60}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:educ}{space 12}{txt:=} {space 9}12}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:female}{space 10}{txt:=} {space 10}1}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:black}{space 11}{txt:=} {space 10}1}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:married}{space 9}{txt:=} {space 10}0}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:finc50}{space 10}{txt:=} {space 10}1}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:wealth89}{space 8}{txt:=} {space 8}150}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}     Margin{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} .2831549{col 26}{space 2} .1543282{col 37}{space 1}    1.83{col 46}{space 3}0.067{col 54}{space 4}-.0193229{col 67}{space 3} .5856327
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. display  .3742912 * 50 +  .2831549 * 100
{res}47.03005
{txt}
{com}. 
. * Then the mean value when choice =0
. estimates restore oprobit1
{txt}(results {stata estimates replay oprobit1:oprobit1} are active now)

{com}. margins, at (choice=0 married=0 female=1 black=1 age=60 educ=12 wealth89=150 finc50=1) predict(outcome(#1))
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}       194
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(pctstck==0), predict(outcome(#1))}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:at}:{space 1}{res:{txt:choice}{space 10}{txt:=} {space 10}0}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:age}{space 13}{txt:=} {space 9}60}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:educ}{space 12}{txt:=} {space 9}12}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:female}{space 10}{txt:=} {space 10}1}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:black}{space 11}{txt:=} {space 10}1}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:married}{space 9}{txt:=} {space 10}0}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:finc50}{space 10}{txt:=} {space 10}1}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:wealth89}{space 8}{txt:=} {space 8}150}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}     Margin{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} .4784586{col 26}{space 2} .1836431{col 37}{space 1}    2.61{col 46}{space 3}0.009{col 54}{space 4} .1185247{col 67}{space 3} .8383924
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. margins, at (choice=0 married=0 female=1 black=1 age=60 educ=12 wealth89=150 finc50=1) predict(outcome(#2))
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}       194
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(pctstck==50), predict(outcome(#2))}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:at}:{space 1}{res:{txt:choice}{space 10}{txt:=} {space 10}0}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:age}{space 13}{txt:=} {space 9}60}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:educ}{space 12}{txt:=} {space 9}12}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:female}{space 10}{txt:=} {space 10}1}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:black}{space 11}{txt:=} {space 10}1}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:married}{space 9}{txt:=} {space 10}0}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:finc50}{space 10}{txt:=} {space 10}1}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:wealth89}{space 8}{txt:=} {space 8}150}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}     Margin{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} .3440748{col 26}{space 2} .0765673{col 37}{space 1}    4.49{col 46}{space 3}0.000{col 54}{space 4} .1940056{col 67}{space 3}  .494144
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. margins, at (choice=0 married=0 female=1 black=1 age=60 educ=12 wealth89=150 finc50=1) predict(outcome(#3))
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}       194
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(pctstck==100), predict(outcome(#3))}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:at}:{space 1}{res:{txt:choice}{space 10}{txt:=} {space 10}0}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:age}{space 13}{txt:=} {space 9}60}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:educ}{space 12}{txt:=} {space 9}12}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:female}{space 10}{txt:=} {space 10}1}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:black}{space 11}{txt:=} {space 10}1}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:married}{space 9}{txt:=} {space 10}0}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:finc50}{space 10}{txt:=} {space 10}1}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col: }{space 2}{res:{txt:wealth89}{space 8}{txt:=} {space 8}150}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}     Margin{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} .1774666{col 26}{space 2}  .114386{col 37}{space 1}    1.55{col 46}{space 3}0.121{col 54}{space 4}-.0467257{col 67}{space 3}  .401659
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. display    .3440748  * 50 + .1774666 * 100
{res}34.9504
{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\AYSPS\AppData\Local\Temp\STD04000000.tmp"
{txt}
{com}. infile  NR YEAR AG BLACK BUS CON ENT EXPER FIN HISP HLTH HOURS MAN MAR MIN NC NE OCC1 OCC2 OCC3 OCC4 OCC5 OCC6 OCC7 OCC8 OCC9 PER PRO PUB RUR S SCHOOL TRA TRAD UNION WAGE  using vv-data.dat, clear
{txt}(4,360 observations read)

{com}. 
. * Descriptive statistics
. logout, save(problem2_summary) word replace: sum

{smcl}
{com}{sf}{ul off}{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}D:\Sony\Econometrics\AdvEcon\Exercise6\Exercise6.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}29 Nov 2016, 11:06:43
{txt}
{com}. 
. *(A) Table II. Find the average marginal effects of logexper, mar, and exper
. gen logexper = log(EXPER+1)
{txt}
{com}. * do pooled probit 
. probit UNION logexper SCHOOL MAR BLACK HISP RUR HLTH NE S NC AG MIN CON MAN TRA TRAD FIN BUS PER ENT PRO OCC1 OCC2 OCC3 OCC4 OCC5 OCC6 OCC7 OCC8 i.YEAR, vce(cluster NR) nolog
{res}
{txt}Probit regression{col 49}Number of obs{col 67}= {res}     4,360
{txt}{col 49}Wald chi2({res}36{txt}){col 67}= {res}    220.62
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log pseudolikelihood = {res}-2137.7713{txt}{col 49}Pseudo R2{col 67}= {res}    0.1176

{txt}{ralign 78:(Std. Err. adjusted for {res:545} clusters in NR)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}       UNION{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}logexper {c |}{col 14}{res}{space 2} .3213463{col 26}{space 2} .2069316{col 37}{space 1}    1.55{col 46}{space 3}0.120{col 54}{space 4}-.0842322{col 67}{space 3} .7269248
{txt}{space 6}SCHOOL {c |}{col 14}{res}{space 2}  .065344{col 26}{space 2} .0305046{col 37}{space 1}    2.14{col 46}{space 3}0.032{col 54}{space 4} .0055562{col 67}{space 3} .1251318
{txt}{space 9}MAR {c |}{col 14}{res}{space 2} .1456957{col 26}{space 2} .0844437{col 37}{space 1}    1.73{col 46}{space 3}0.084{col 54}{space 4}-.0198109{col 67}{space 3} .3112024
{txt}{space 7}BLACK {c |}{col 14}{res}{space 2} .3994051{col 26}{space 2} .1320053{col 37}{space 1}    3.03{col 46}{space 3}0.002{col 54}{space 4} .1406794{col 67}{space 3} .6581308
{txt}{space 8}HISP {c |}{col 14}{res}{space 2} .1992929{col 26}{space 2}  .135096{col 37}{space 1}    1.48{col 46}{space 3}0.140{col 54}{space 4}-.0654904{col 67}{space 3} .4640762
{txt}{space 9}RUR {c |}{col 14}{res}{space 2} -.063686{col 26}{space 2} .1087122{col 37}{space 1}   -0.59{col 46}{space 3}0.558{col 54}{space 4}-.2767579{col 67}{space 3}  .149386
{txt}{space 8}HLTH {c |}{col 14}{res}{space 2}-.4984663{col 26}{space 2} .2285934{col 37}{space 1}   -2.18{col 46}{space 3}0.029{col 54}{space 4}-.9465011{col 67}{space 3}-.0504315
{txt}{space 10}NE {c |}{col 14}{res}{space 2} .1685646{col 26}{space 2} .1536425{col 37}{space 1}    1.10{col 46}{space 3}0.273{col 54}{space 4}-.1325692{col 67}{space 3} .4696984
{txt}{space 11}S {c |}{col 14}{res}{space 2}-.0285951{col 26}{space 2} .1348062{col 37}{space 1}   -0.21{col 46}{space 3}0.832{col 54}{space 4}-.2928104{col 67}{space 3} .2356202
{txt}{space 10}NC {c |}{col 14}{res}{space 2} .1698988{col 26}{space 2} .1506241{col 37}{space 1}    1.13{col 46}{space 3}0.259{col 54}{space 4}-.1253189{col 67}{space 3} .4651166
{txt}{space 10}AG {c |}{col 14}{res}{space 2}-.7722583{col 26}{space 2}  .330035{col 37}{space 1}   -2.34{col 46}{space 3}0.019{col 54}{space 4}-1.419115{col 67}{space 3}-.1254017
{txt}{space 9}MIN {c |}{col 14}{res}{space 2}-.3038761{col 26}{space 2} .3571261{col 37}{space 1}   -0.85{col 46}{space 3}0.395{col 54}{space 4} -1.00383{col 67}{space 3} .3960783
{txt}{space 9}CON {c |}{col 14}{res}{space 2}-.7386713{col 26}{space 2} .2132112{col 37}{space 1}   -3.46{col 46}{space 3}0.001{col 54}{space 4}-1.156558{col 67}{space 3} -.320785
{txt}{space 9}MAN {c |}{col 14}{res}{space 2}-.3835445{col 26}{space 2}  .178649{col 37}{space 1}   -2.15{col 46}{space 3}0.032{col 54}{space 4}-.7336902{col 67}{space 3}-.0333988
{txt}{space 9}TRA {c |}{col 14}{res}{space 2}-.0008608{col 26}{space 2} .2107734{col 37}{space 1}   -0.00{col 46}{space 3}0.997{col 54}{space 4}-.4139691{col 67}{space 3} .4122475
{txt}{space 8}TRAD {c |}{col 14}{res}{space 2}-.7496549{col 26}{space 2} .1845936{col 37}{space 1}   -4.06{col 46}{space 3}0.000{col 54}{space 4}-1.111452{col 67}{space 3}-.3878581
{txt}{space 9}FIN {c |}{col 14}{res}{space 2}-1.053801{col 26}{space 2} .3236664{col 37}{space 1}   -3.26{col 46}{space 3}0.001{col 54}{space 4}-1.688176{col 67}{space 3}-.4194264
{txt}{space 9}BUS {c |}{col 14}{res}{space 2}-1.134537{col 26}{space 2}  .197809{col 37}{space 1}   -5.74{col 46}{space 3}0.000{col 54}{space 4}-1.522235{col 67}{space 3}-.7468381
{txt}{space 9}PER {c |}{col 14}{res}{space 2}-1.105549{col 26}{space 2}  .240657{col 37}{space 1}   -4.59{col 46}{space 3}0.000{col 54}{space 4}-1.577228{col 67}{space 3}-.6338701
{txt}{space 9}ENT {c |}{col 14}{res}{space 2}-.8261857{col 26}{space 2} .3645613{col 37}{space 1}   -2.27{col 46}{space 3}0.023{col 54}{space 4}-1.540713{col 67}{space 3}-.1116588
{txt}{space 9}PRO {c |}{col 14}{res}{space 2} -.303772{col 26}{space 2} .2062215{col 37}{space 1}   -1.47{col 46}{space 3}0.141{col 54}{space 4}-.7079587{col 67}{space 3} .1004148
{txt}{space 8}OCC1 {c |}{col 14}{res}{space 2}-.8081782{col 26}{space 2} .1685245{col 37}{space 1}   -4.80{col 46}{space 3}0.000{col 54}{space 4} -1.13848{col 67}{space 3}-.4778764
{txt}{space 8}OCC2 {c |}{col 14}{res}{space 2}-.9058924{col 26}{space 2} .1738089{col 37}{space 1}   -5.21{col 46}{space 3}0.000{col 54}{space 4}-1.246552{col 67}{space 3}-.5652332
{txt}{space 8}OCC3 {c |}{col 14}{res}{space 2}-.9414642{col 26}{space 2} .1951134{col 37}{space 1}   -4.83{col 46}{space 3}0.000{col 54}{space 4} -1.32388{col 67}{space 3}-.5590489
{txt}{space 8}OCC4 {c |}{col 14}{res}{space 2}-.1741098{col 26}{space 2} .1442602{col 37}{space 1}   -1.21{col 46}{space 3}0.227{col 54}{space 4}-.4568546{col 67}{space 3} .1086349
{txt}{space 8}OCC5 {c |}{col 14}{res}{space 2}-.2441014{col 26}{space 2} .1287551{col 37}{space 1}   -1.90{col 46}{space 3}0.058{col 54}{space 4}-.4964567{col 67}{space 3} .0082539
{txt}{space 8}OCC6 {c |}{col 14}{res}{space 2}-.0344374{col 26}{space 2} .1312324{col 37}{space 1}   -0.26{col 46}{space 3}0.793{col 54}{space 4}-.2916482{col 67}{space 3} .2227735
{txt}{space 8}OCC7 {c |}{col 14}{res}{space 2} .1523234{col 26}{space 2} .1409954{col 37}{space 1}    1.08{col 46}{space 3}0.280{col 54}{space 4}-.1240225{col 67}{space 3} .4286693
{txt}{space 8}OCC8 {c |}{col 14}{res}{space 2}-.6297154{col 26}{space 2} .3612657{col 37}{space 1}   -1.74{col 46}{space 3}0.081{col 54}{space 4}-1.337783{col 67}{space 3} .0783524
{txt}{space 12} {c |}
{space 8}YEAR {c |}
{space 7}1981  {c |}{col 14}{res}{space 2}-.0917971{col 26}{space 2} .0787216{col 37}{space 1}   -1.17{col 46}{space 3}0.244{col 54}{space 4}-.2460886{col 67}{space 3} .0624943
{txt}{space 7}1982  {c |}{col 14}{res}{space 2}-.1211369{col 26}{space 2} .1137658{col 37}{space 1}   -1.06{col 46}{space 3}0.287{col 54}{space 4}-.3441138{col 67}{space 3}   .10184
{txt}{space 7}1983  {c |}{col 14}{res}{space 2}-.2334464{col 26}{space 2} .1426773{col 37}{space 1}   -1.64{col 46}{space 3}0.102{col 54}{space 4}-.5130889{col 67}{space 3}  .046196
{txt}{space 7}1984  {c |}{col 14}{res}{space 2}-.2248228{col 26}{space 2} .1674907{col 37}{space 1}   -1.34{col 46}{space 3}0.179{col 54}{space 4}-.5530986{col 67}{space 3}  .103453
{txt}{space 7}1985  {c |}{col 14}{res}{space 2}-.3785973{col 26}{space 2}   .19065{col 37}{space 1}   -1.99{col 46}{space 3}0.047{col 54}{space 4}-.7522643{col 67}{space 3}-.0049302
{txt}{space 7}1986  {c |}{col 14}{res}{space 2}-.4675467{col 26}{space 2} .2121943{col 37}{space 1}   -2.20{col 46}{space 3}0.028{col 54}{space 4}-.8834399{col 67}{space 3}-.0516536
{txt}{space 7}1987  {c |}{col 14}{res}{space 2}-.2966825{col 26}{space 2} .2319901{col 37}{space 1}   -1.28{col 46}{space 3}0.201{col 54}{space 4}-.7513748{col 67}{space 3} .1580097
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-1.281985{col 26}{space 2} .6196927{col 37}{space 1}   -2.07{col 46}{space 3}0.039{col 54}{space 4}-2.496561{col 67}{space 3}-.0674101
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. outreg2 using pooledprobit1_table1, title(Pooled probit model) word replace
{txt}{stata `"shellout using `"pooledprobit1_table1.rtf"'"':pooledprobit1_table1.rtf}
{browse `"D:\Sony\Econometrics\AdvEcon\Exercise6"' :dir}{com} : {txt}{stata `"seeout using "pooledprobit1_table1.txt""':seeout}

{com}. estimates store probit1
{txt}
{com}. margins, dydx(logexper MAR) post
{res}
{txt}Average marginal effects{col 49}Number of obs{col 67}= {res}     4,360
{txt}Model VCE{col 14}: {res}Robust

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(UNION), predict()}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:logexper MAR}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}logexper {c |}{col 14}{res}{space 2} .0888919{col 26}{space 2} .0571552{col 37}{space 1}    1.56{col 46}{space 3}0.120{col 54}{space 4}-.0231302{col 67}{space 3}  .200914
{txt}{space 9}MAR {c |}{col 14}{res}{space 2} .0403029{col 26}{space 2} .0232626{col 37}{space 1}    1.73{col 46}{space 3}0.083{col 54}{space 4} -.005291{col 67}{space 3} .0858967
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. estimates restore probit1
{txt}(results {stata estimates replay probit1:probit1} are active now)

{com}. margins, expression(_b[logexper]*predict()/100) post
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}     4,360
{txt}Model VCE{col 14}: {res}Robust

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:_b[logexper]*predict()/100}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}     Margin{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2} .0007857{col 26}{space 2} .0005095{col 37}{space 1}    1.54{col 46}{space 3}0.123{col 54}{space 4}-.0002129{col 67}{space 3} .0017844
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. *(B) The random effects probit estimator
. xtset NR YEAR
{res}{txt}{col 8}panel variable:  {res}NR (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}YEAR, 1980 to 1987
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. xtprobit UNION logexper SCHOOL MAR BLACK HISP RUR HLTH NE S NC AG MIN CON MAN TRA TRAD FIN BUS PER ENT PRO OCC1 OCC2 OCC3 OCC4 OCC5 OCC6 OCC7 OCC8 YEAR if 1981<=YEAR & YEAR<=1987, nolog

{txt}Random-effects probit regression{col 49}Number of obs{col 67}={col 69}{res}     3,815
{txt}Group variable: {res}NR{col 49}{txt}Number of groups{col 67}={col 69}{res}       545

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         7
{txt}{col 63}avg{col 67}={col 69}{res}       7.0
{txt}{col 63}max{col 67}={col 69}{res}         7

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}30{txt}){col 67}={col 70}{res}   129.85
{txt}Log likelihood  = {res}-1347.6037{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       UNION{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}logexper {c |}{col 14}{res}{space 2} .3561606{col 26}{space 2} .3739529{col 37}{space 1}    0.95{col 46}{space 3}0.341{col 54}{space 4}-.3767737{col 67}{space 3} 1.089095
{txt}{space 6}SCHOOL {c |}{col 14}{res}{space 2} .0395627{col 26}{space 2} .0597176{col 37}{space 1}    0.66{col 46}{space 3}0.508{col 54}{space 4}-.0774815{col 67}{space 3}  .156607
{txt}{space 9}MAR {c |}{col 14}{res}{space 2} .1599713{col 26}{space 2} .1052744{col 37}{space 1}    1.52{col 46}{space 3}0.129{col 54}{space 4}-.0463627{col 67}{space 3} .3663052
{txt}{space 7}BLACK {c |}{col 14}{res}{space 2}   1.0072{col 26}{space 2}  .281159{col 37}{space 1}    3.58{col 46}{space 3}0.000{col 54}{space 4} .4561383{col 67}{space 3} 1.558262
{txt}{space 8}HISP {c |}{col 14}{res}{space 2} .5186857{col 26}{space 2} .2648371{col 37}{space 1}    1.96{col 46}{space 3}0.050{col 54}{space 4}-.0003855{col 67}{space 3} 1.037757
{txt}{space 9}RUR {c |}{col 14}{res}{space 2} .0233931{col 26}{space 2} .1529969{col 37}{space 1}    0.15{col 46}{space 3}0.878{col 54}{space 4}-.2764753{col 67}{space 3} .3232614
{txt}{space 8}HLTH {c |}{col 14}{res}{space 2} -.362684{col 26}{space 2} .3129745{col 37}{space 1}   -1.16{col 46}{space 3}0.247{col 54}{space 4}-.9761028{col 67}{space 3} .2507348
{txt}{space 10}NE {c |}{col 14}{res}{space 2}  .431466{col 26}{space 2} .2564161{col 37}{space 1}    1.68{col 46}{space 3}0.092{col 54}{space 4}-.0711003{col 67}{space 3} .9340323
{txt}{space 11}S {c |}{col 14}{res}{space 2}-.0758453{col 26}{space 2} .2340413{col 37}{space 1}   -0.32{col 46}{space 3}0.746{col 54}{space 4}-.5345578{col 67}{space 3} .3828672
{txt}{space 10}NC {c |}{col 14}{res}{space 2}  .267029{col 26}{space 2}  .239328{col 37}{space 1}    1.12{col 46}{space 3}0.265{col 54}{space 4}-.2020452{col 67}{space 3} .7361031
{txt}{space 10}AG {c |}{col 14}{res}{space 2}-1.051351{col 26}{space 2} .3680405{col 37}{space 1}   -2.86{col 46}{space 3}0.004{col 54}{space 4}-1.772697{col 67}{space 3}-.3300045
{txt}{space 9}MIN {c |}{col 14}{res}{space 2}-.4643731{col 26}{space 2} .4423225{col 37}{space 1}   -1.05{col 46}{space 3}0.294{col 54}{space 4}-1.331309{col 67}{space 3} .4025631
{txt}{space 9}CON {c |}{col 14}{res}{space 2}-.7761026{col 26}{space 2} .2539641{col 37}{space 1}   -3.06{col 46}{space 3}0.002{col 54}{space 4}-1.273863{col 67}{space 3}-.2783422
{txt}{space 9}MAN {c |}{col 14}{res}{space 2} -.254346{col 26}{space 2} .2167271{col 37}{space 1}   -1.17{col 46}{space 3}0.241{col 54}{space 4}-.6791233{col 67}{space 3} .1704314
{txt}{space 9}TRA {c |}{col 14}{res}{space 2}-.1068427{col 26}{space 2} .2470712{col 37}{space 1}   -0.43{col 46}{space 3}0.665{col 54}{space 4}-.5910933{col 67}{space 3} .3774079
{txt}{space 8}TRAD {c |}{col 14}{res}{space 2}-.8176787{col 26}{space 2} .2195612{col 37}{space 1}   -3.72{col 46}{space 3}0.000{col 54}{space 4}-1.248011{col 67}{space 3}-.3873467
{txt}{space 9}FIN {c |}{col 14}{res}{space 2}-2.136762{col 26}{space 2} .4530997{col 37}{space 1}   -4.72{col 46}{space 3}0.000{col 54}{space 4}-3.024821{col 67}{space 3}-1.248702
{txt}{space 9}BUS {c |}{col 14}{res}{space 2} -1.14312{col 26}{space 2} .2628042{col 37}{space 1}   -4.35{col 46}{space 3}0.000{col 54}{space 4}-1.658207{col 67}{space 3}-.6280332
{txt}{space 9}PER {c |}{col 14}{res}{space 2}-1.216819{col 26}{space 2} .3904453{col 37}{space 1}   -3.12{col 46}{space 3}0.002{col 54}{space 4}-1.982078{col 67}{space 3}-.4515607
{txt}{space 9}ENT {c |}{col 14}{res}{space 2}-.5096084{col 26}{space 2} .4076757{col 37}{space 1}   -1.25{col 46}{space 3}0.211{col 54}{space 4}-1.308638{col 67}{space 3} .2894213
{txt}{space 9}PRO {c |}{col 14}{res}{space 2}-.0486409{col 26}{space 2}  .236914{col 37}{space 1}   -0.21{col 46}{space 3}0.837{col 54}{space 4}-.5129838{col 67}{space 3}  .415702
{txt}{space 8}OCC1 {c |}{col 14}{res}{space 2}-.6474026{col 26}{space 2} .2046685{col 37}{space 1}   -3.16{col 46}{space 3}0.002{col 54}{space 4}-1.048545{col 67}{space 3}-.2462598
{txt}{space 8}OCC2 {c |}{col 14}{res}{space 2}-.8618519{col 26}{space 2} .2296987{col 37}{space 1}   -3.75{col 46}{space 3}0.000{col 54}{space 4}-1.312053{col 67}{space 3}-.4116507
{txt}{space 8}OCC3 {c |}{col 14}{res}{space 2}-.7015482{col 26}{space 2} .2717852{col 37}{space 1}   -2.58{col 46}{space 3}0.010{col 54}{space 4}-1.234237{col 67}{space 3} -.168859
{txt}{space 8}OCC4 {c |}{col 14}{res}{space 2}-.2776412{col 26}{space 2} .1881274{col 37}{space 1}   -1.48{col 46}{space 3}0.140{col 54}{space 4}-.6463642{col 67}{space 3} .0910817
{txt}{space 8}OCC5 {c |}{col 14}{res}{space 2}-.1078973{col 26}{space 2} .1761258{col 37}{space 1}   -0.61{col 46}{space 3}0.540{col 54}{space 4}-.4530975{col 67}{space 3}  .237303
{txt}{space 8}OCC6 {c |}{col 14}{res}{space 2}-.1657011{col 26}{space 2} .1744427{col 37}{space 1}   -0.95{col 46}{space 3}0.342{col 54}{space 4}-.5076026{col 67}{space 3} .1762003
{txt}{space 8}OCC7 {c |}{col 14}{res}{space 2} .0629168{col 26}{space 2} .1913442{col 37}{space 1}    0.33{col 46}{space 3}0.742{col 54}{space 4} -.312111{col 67}{space 3} .4379446
{txt}{space 8}OCC8 {c |}{col 14}{res}{space 2} .1951042{col 26}{space 2} .4765029{col 37}{space 1}    0.41{col 46}{space 3}0.682{col 54}{space 4}-.7388243{col 67}{space 3} 1.129033
{txt}{space 8}YEAR {c |}{col 14}{res}{space 2}-.0692844{col 26}{space 2} .0523741{col 37}{space 1}   -1.32{col 46}{space 3}0.186{col 54}{space 4}-.1719358{col 67}{space 3}  .033367
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 135.2023{col 26}{space 2} 102.9471{col 37}{space 1}    1.31{col 46}{space 3}0.189{col 54}{space 4}-66.57026{col 67}{space 3} 336.9749
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
    /lnsig2u {c |}{col 14}{res}{space 2} 1.134475{col 26}{space 2} .1265213{col 54}{space 4} .8864978{col 67}{space 3} 1.382452
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |}{col 14}{res}{space 2} 1.763389{col 26}{space 2} .1115531{col 54}{space 4}  1.55776{col 67}{space 3} 1.996161
{txt}         rho {c |}{col 14}{res}{space 2} .7566638{col 26}{space 2} .0232956{col 54}{space 4} .7081669{col 67}{space 3} .7993845
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{txt}LR test of rho=0: {help j_chibar##|_new:chibar2(01) = }{res}1036.70{col 56}{txt}Prob >= chibar2 = {res}0.000
{txt}
{com}. outreg2 using re_probit_table, title(Random effect Probit Regression) word replace
{txt}{stata `"shellout using `"re_probit_table.rtf"'"':re_probit_table.rtf}
{browse `"D:\Sony\Econometrics\AdvEcon\Exercise6"' :dir}{com} : {txt}{stata `"seeout using "re_probit_table.txt""':seeout}

{com}. estimates store probit2
{txt}
{com}. margins, dydx(logexper MAR) post
{res}
{txt}Average marginal effects{col 49}Number of obs{col 67}= {res}     3,815
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(UNION=1), predict(pr)}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:logexper MAR}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}logexper {c |}{col 14}{res}{space 2} .0514122{col 26}{space 2} .0539762{col 37}{space 1}    0.95{col 46}{space 3}0.341{col 54}{space 4}-.0543793{col 67}{space 3} .1572037
{txt}{space 9}MAR {c |}{col 14}{res}{space 2}  .023092{col 26}{space 2} .0152287{col 37}{space 1}    1.52{col 46}{space 3}0.129{col 54}{space 4}-.0067556{col 67}{space 3} .0529397
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. estimates restore probit2
{txt}(results {stata estimates replay probit2:probit2} are active now)

{com}. margins, expression(_b[logexper]*predict()/100) post
{res}
{txt}Predictive margins{col 49}Number of obs{col 67}= {res}     3,815
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:_b[logexper]*predict()/100}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}     Margin{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0054777{col 26}{space 2} .0057661{col 37}{space 1}   -0.95{col 46}{space 3}0.342{col 54}{space 4} -.016779{col 67}{space 3} .0058236
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "C:\Users\AYSPS\AppData\Local\Temp\STD04000000.tmp"
{txt}
{com}. foreach var of varlist logexper HOURS WAGE{c -(}
{txt}  2{com}.     egen bar`var' = mean(`var'), by(NR)
{txt}  3{com}. {c )-}
{txt}
{com}. xtprobit UNION bar* logexper SCHOOL MAR BLACK HISP RUR HLTH NE S NC AG MIN CON MAN TRA TRAD FIN BUS PER ENT PRO OCC1 OCC2 OCC3 OCC4 OCC5 OCC6 OCC7 OCC8 YEAR if 1981<=YEAR & YEAR<=1987, vce(robust) nolog 

{txt}Calculating robust standard errors:

Random-effects probit regression{col 49}Number of obs{col 67}={col 69}{res}     3,815
{txt}Group variable: {res}NR{col 49}{txt}Number of groups{col 67}={col 69}{res}       545

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         7
{txt}{col 63}avg{col 67}={col 69}{res}       7.0
{txt}{col 63}max{col 67}={col 69}{res}         7

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}33{txt}){col 67}={col 70}{res}   124.91
{txt}Log pseudolikelihood  = {res}-1335.7922{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0000

{txt}{ralign 78:(Std. Err. adjusted for {res:545} clusters in NR)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}       UNION{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}barlogexper {c |}{col 14}{res}{space 2}-.0667401{col 26}{space 2} .7660955{col 37}{space 1}   -0.09{col 46}{space 3}0.931{col 54}{space 4} -1.56826{col 67}{space 3} 1.434779
{txt}{space 4}barHOURS {c |}{col 14}{res}{space 2}-.0001082{col 26}{space 2} .0002048{col 37}{space 1}   -0.53{col 46}{space 3}0.597{col 54}{space 4}-.0005095{col 67}{space 3} .0002931
{txt}{space 5}barWAGE {c |}{col 14}{res}{space 2} 1.234156{col 26}{space 2} .2605658{col 37}{space 1}    4.74{col 46}{space 3}0.000{col 54}{space 4} .7234564{col 67}{space 3} 1.744856
{txt}{space 4}logexper {c |}{col 14}{res}{space 2} .2403479{col 26}{space 2} .6319819{col 37}{space 1}    0.38{col 46}{space 3}0.704{col 54}{space 4}-.9983139{col 67}{space 3}  1.47901
{txt}{space 6}SCHOOL {c |}{col 14}{res}{space 2}-.0549615{col 26}{space 2} .0650486{col 37}{space 1}   -0.84{col 46}{space 3}0.398{col 54}{space 4}-.1824543{col 67}{space 3} .0725314
{txt}{space 9}MAR {c |}{col 14}{res}{space 2}  .131839{col 26}{space 2} .1133327{col 37}{space 1}    1.16{col 46}{space 3}0.245{col 54}{space 4}-.0902889{col 67}{space 3} .3539669
{txt}{space 7}BLACK {c |}{col 14}{res}{space 2} 1.129955{col 26}{space 2} .2670444{col 37}{space 1}    4.23{col 46}{space 3}0.000{col 54}{space 4} .6065577{col 67}{space 3} 1.653353
{txt}{space 8}HISP {c |}{col 14}{res}{space 2} .5344296{col 26}{space 2} .2431858{col 37}{space 1}    2.20{col 46}{space 3}0.028{col 54}{space 4} .0577941{col 67}{space 3} 1.011065
{txt}{space 9}RUR {c |}{col 14}{res}{space 2}  .087887{col 26}{space 2} .1551132{col 37}{space 1}    0.57{col 46}{space 3}0.571{col 54}{space 4}-.2161292{col 67}{space 3} .3919032
{txt}{space 8}HLTH {c |}{col 14}{res}{space 2}-.3729237{col 26}{space 2} .3296193{col 37}{space 1}   -1.13{col 46}{space 3}0.258{col 54}{space 4}-1.018966{col 67}{space 3} .2731182
{txt}{space 10}NE {c |}{col 14}{res}{space 2} .3889116{col 26}{space 2} .2689517{col 37}{space 1}    1.45{col 46}{space 3}0.148{col 54}{space 4}-.1382241{col 67}{space 3} .9160472
{txt}{space 11}S {c |}{col 14}{res}{space 2} .0288917{col 26}{space 2} .2294955{col 37}{space 1}    0.13{col 46}{space 3}0.900{col 54}{space 4}-.4209113{col 67}{space 3} .4786947
{txt}{space 10}NC {c |}{col 14}{res}{space 2} .3133746{col 26}{space 2} .2788304{col 37}{space 1}    1.12{col 46}{space 3}0.261{col 54}{space 4} -.233123{col 67}{space 3} .8598722
{txt}{space 10}AG {c |}{col 14}{res}{space 2}-.9665309{col 26}{space 2} .4015072{col 37}{space 1}   -2.41{col 46}{space 3}0.016{col 54}{space 4}-1.753471{col 67}{space 3}-.1795912
{txt}{space 9}MIN {c |}{col 14}{res}{space 2}-.5864173{col 26}{space 2} .5245764{col 37}{space 1}   -1.12{col 46}{space 3}0.264{col 54}{space 4}-1.614568{col 67}{space 3} .4417336
{txt}{space 9}CON {c |}{col 14}{res}{space 2}-.7943505{col 26}{space 2} .2818056{col 37}{space 1}   -2.82{col 46}{space 3}0.005{col 54}{space 4}-1.346679{col 67}{space 3}-.2420216
{txt}{space 9}MAN {c |}{col 14}{res}{space 2}-.2976433{col 26}{space 2} .2647757{col 37}{space 1}   -1.12{col 46}{space 3}0.261{col 54}{space 4}-.8165942{col 67}{space 3} .2213076
{txt}{space 9}TRA {c |}{col 14}{res}{space 2}-.1503728{col 26}{space 2} .2959105{col 37}{space 1}   -0.51{col 46}{space 3}0.611{col 54}{space 4}-.7303467{col 67}{space 3}  .429601
{txt}{space 8}TRAD {c |}{col 14}{res}{space 2}-.8003605{col 26}{space 2} .2721292{col 37}{space 1}   -2.94{col 46}{space 3}0.003{col 54}{space 4}-1.333724{col 67}{space 3}-.2669971
{txt}{space 9}FIN {c |}{col 14}{res}{space 2} -2.15266{col 26}{space 2} .5146853{col 37}{space 1}   -4.18{col 46}{space 3}0.000{col 54}{space 4}-3.161425{col 67}{space 3}-1.143895
{txt}{space 9}BUS {c |}{col 14}{res}{space 2}-1.109356{col 26}{space 2} .2908992{col 37}{space 1}   -3.81{col 46}{space 3}0.000{col 54}{space 4}-1.679508{col 67}{space 3}-.5392045
{txt}{space 9}PER {c |}{col 14}{res}{space 2}-1.174167{col 26}{space 2} .3948786{col 37}{space 1}   -2.97{col 46}{space 3}0.003{col 54}{space 4}-1.948115{col 67}{space 3}-.4002192
{txt}{space 9}ENT {c |}{col 14}{res}{space 2}-.4033258{col 26}{space 2} .5466232{col 37}{space 1}   -0.74{col 46}{space 3}0.461{col 54}{space 4}-1.474688{col 67}{space 3} .6680359
{txt}{space 9}PRO {c |}{col 14}{res}{space 2}-.0044617{col 26}{space 2} .3238986{col 37}{space 1}   -0.01{col 46}{space 3}0.989{col 54}{space 4}-.6392912{col 67}{space 3} .6303678
{txt}{space 8}OCC1 {c |}{col 14}{res}{space 2}-.7347281{col 26}{space 2} .2755219{col 37}{space 1}   -2.67{col 46}{space 3}0.008{col 54}{space 4}-1.274741{col 67}{space 3}-.1947151
{txt}{space 8}OCC2 {c |}{col 14}{res}{space 2}-.9122019{col 26}{space 2} .2580626{col 37}{space 1}   -3.53{col 46}{space 3}0.000{col 54}{space 4}-1.417995{col 67}{space 3}-.4064085
{txt}{space 8}OCC3 {c |}{col 14}{res}{space 2} -.749746{col 26}{space 2} .3393052{col 37}{space 1}   -2.21{col 46}{space 3}0.027{col 54}{space 4}-1.414772{col 67}{space 3}-.0847201
{txt}{space 8}OCC4 {c |}{col 14}{res}{space 2}-.3257138{col 26}{space 2} .2319527{col 37}{space 1}   -1.40{col 46}{space 3}0.160{col 54}{space 4}-.7803327{col 67}{space 3} .1289052
{txt}{space 8}OCC5 {c |}{col 14}{res}{space 2}-.1738365{col 26}{space 2} .2112357{col 37}{space 1}   -0.82{col 46}{space 3}0.411{col 54}{space 4}-.5878509{col 67}{space 3} .2401779
{txt}{space 8}OCC6 {c |}{col 14}{res}{space 2}-.2023133{col 26}{space 2} .2138088{col 37}{space 1}   -0.95{col 46}{space 3}0.344{col 54}{space 4}-.6213709{col 67}{space 3} .2167443
{txt}{space 8}OCC7 {c |}{col 14}{res}{space 2} .0434653{col 26}{space 2}  .215735{col 37}{space 1}    0.20{col 46}{space 3}0.840{col 54}{space 4}-.3793676{col 67}{space 3} .4662982
{txt}{space 8}OCC8 {c |}{col 14}{res}{space 2} .1882655{col 26}{space 2} .5617767{col 37}{space 1}    0.34{col 46}{space 3}0.738{col 54}{space 4}-.9127966{col 67}{space 3} 1.289328
{txt}{space 8}YEAR {c |}{col 14}{res}{space 2}-.0500244{col 26}{space 2} .0853561{col 37}{space 1}   -0.59{col 46}{space 3}0.558{col 54}{space 4}-.2173194{col 67}{space 3} .1172706
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 96.68962{col 26}{space 2} 169.2792{col 37}{space 1}    0.57{col 46}{space 3}0.568{col 54}{space 4}-235.0915{col 67}{space 3} 428.4707
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
    /lnsig2u {c |}{col 14}{res}{space 2} 1.037548{col 26}{space 2}  .133295{col 54}{space 4}  .776295{col 67}{space 3} 1.298802
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |}{col 14}{res}{space 2} 1.679967{col 26}{space 2} .1119656{col 54}{space 4} 1.474247{col 67}{space 3} 1.914394
{txt}         rho {c |}{col 14}{res}{space 2} .7383767{col 26}{space 2} .0257495{col 54}{space 4} .6848811{col 67}{space 3} .7856333
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. outreg2 using correlated_re_probit_table, title(Correlated Random Effect Probit Regression) word replace
{txt}{stata `"shellout using `"correlated_re_probit_table.rtf"'"':correlated_re_probit_table.rtf}
{browse `"D:\Sony\Econometrics\AdvEcon\Exercise6"' :dir}{com} : {txt}{stata `"seeout using "correlated_re_probit_table.txt""':seeout}

{com}. margins, dydx(logexper) post
{res}
{txt}Average marginal effects{col 49}Number of obs{col 67}= {res}     3,815
{txt}Model VCE{col 14}: {res}Robust

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(UNION=1), predict(pr)}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:logexper}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}logexper {c |}{col 14}{res}{space 2} .0352186{col 26}{space 2} .0925232{col 37}{space 1}    0.38{col 46}{space 3}0.703{col 54}{space 4}-.1461236{col 67}{space 3} .2165608
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. *(D) Test for state dependence in unionism.
. * create the lagged variable
. by NR: gen lagged_union = UNION[_n-1] if YEAR==YEAR[_n-1]+1 
{txt}(545 missing values generated)

{com}. xtprobit UNION logexper lagged_union SCHOOL MAR BLACK HISP RUR HLTH NE S NC AG MIN CON MAN TRA TRAD FIN BUS PER ENT PRO OCC1 OCC2 OCC3 OCC4 OCC5 OCC6 OCC7 OCC8 YEAR if 1981<=YEAR & YEAR<=1987, vce(robust) nolog 

{txt}Calculating robust standard errors:

Random-effects probit regression{col 49}Number of obs{col 67}={col 69}{res}     3,815
{txt}Group variable: {res}NR{col 49}{txt}Number of groups{col 67}={col 69}{res}       545

{txt}Random effects u_i ~ {res}Gaussian{txt}{col 49}Obs per group:
{col 63}min{col 67}={col 69}{res}         7
{txt}{col 63}avg{col 67}={col 69}{res}       7.0
{txt}{col 63}max{col 67}={col 69}{res}         7

{txt}Integration method: {res}mvaghermite{txt}{col 49}Integration pts.{col 67}={col 70}{res}       12

{txt}{col 49}Wald chi2({res}31{txt}){col 67}={col 70}{res}   232.36
{txt}Log pseudolikelihood  = {res}-1291.1345{col 49}{txt}Prob > chi2{col 67}={res}{col 73}0.0000

{txt}{ralign 78:(Std. Err. adjusted for {res:545} clusters in NR)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}       UNION{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}logexper {c |}{col 14}{res}{space 2}-.0006826{col 26}{space 2} .2622669{col 37}{space 1}   -0.00{col 46}{space 3}0.998{col 54}{space 4}-.5147163{col 67}{space 3} .5133511
{txt}lagged_union {c |}{col 14}{res}{space 2} 1.134056{col 26}{space 2} .1585542{col 37}{space 1}    7.15{col 46}{space 3}0.000{col 54}{space 4} .8232953{col 67}{space 3} 1.444816
{txt}{space 6}SCHOOL {c |}{col 14}{res}{space 2} .0269341{col 26}{space 2}  .037023{col 37}{space 1}    0.73{col 46}{space 3}0.467{col 54}{space 4}-.0456297{col 67}{space 3} .0994978
{txt}{space 9}MAR {c |}{col 14}{res}{space 2}  .186734{col 26}{space 2} .0902681{col 37}{space 1}    2.07{col 46}{space 3}0.039{col 54}{space 4} .0098118{col 67}{space 3} .3636562
{txt}{space 7}BLACK {c |}{col 14}{res}{space 2} .6125212{col 26}{space 2} .1787322{col 37}{space 1}    3.43{col 46}{space 3}0.001{col 54}{space 4} .2622125{col 67}{space 3} .9628298
{txt}{space 8}HISP {c |}{col 14}{res}{space 2} .2786244{col 26}{space 2} .1632106{col 37}{space 1}    1.71{col 46}{space 3}0.088{col 54}{space 4}-.0412625{col 67}{space 3} .5985112
{txt}{space 9}RUR {c |}{col 14}{res}{space 2}-.0234494{col 26}{space 2} .1126364{col 37}{space 1}   -0.21{col 46}{space 3}0.835{col 54}{space 4}-.2442127{col 67}{space 3}  .197314
{txt}{space 8}HLTH {c |}{col 14}{res}{space 2}-.3478369{col 26}{space 2} .3198093{col 37}{space 1}   -1.09{col 46}{space 3}0.277{col 54}{space 4}-.9746516{col 67}{space 3} .2789778
{txt}{space 10}NE {c |}{col 14}{res}{space 2}  .190219{col 26}{space 2} .1765076{col 37}{space 1}    1.08{col 46}{space 3}0.281{col 54}{space 4}-.1557295{col 67}{space 3} .5361675
{txt}{space 11}S {c |}{col 14}{res}{space 2}-.0483962{col 26}{space 2} .1535383{col 37}{space 1}   -0.32{col 46}{space 3}0.753{col 54}{space 4}-.3493256{col 67}{space 3} .2525333
{txt}{space 10}NC {c |}{col 14}{res}{space 2} .1609815{col 26}{space 2} .1805202{col 37}{space 1}    0.89{col 46}{space 3}0.373{col 54}{space 4}-.1928316{col 67}{space 3} .5147947
{txt}{space 10}AG {c |}{col 14}{res}{space 2} -.733538{col 26}{space 2} .3389046{col 37}{space 1}   -2.16{col 46}{space 3}0.030{col 54}{space 4}-1.397779{col 67}{space 3}-.0692971
{txt}{space 9}MIN {c |}{col 14}{res}{space 2}-.2492795{col 26}{space 2} .4262533{col 37}{space 1}   -0.58{col 46}{space 3}0.559{col 54}{space 4}-1.084721{col 67}{space 3} .5861617
{txt}{space 9}CON {c |}{col 14}{res}{space 2}-.6181068{col 26}{space 2} .2422994{col 37}{space 1}   -2.55{col 46}{space 3}0.011{col 54}{space 4}-1.093005{col 67}{space 3}-.1432088
{txt}{space 9}MAN {c |}{col 14}{res}{space 2}-.2127936{col 26}{space 2} .2162041{col 37}{space 1}   -0.98{col 46}{space 3}0.325{col 54}{space 4}-.6365459{col 67}{space 3} .2109587
{txt}{space 9}TRA {c |}{col 14}{res}{space 2}-.0946101{col 26}{space 2} .2480924{col 37}{space 1}   -0.38{col 46}{space 3}0.703{col 54}{space 4}-.5808622{col 67}{space 3}  .391642
{txt}{space 8}TRAD {c |}{col 14}{res}{space 2}-.6653534{col 26}{space 2} .2178689{col 37}{space 1}   -3.05{col 46}{space 3}0.002{col 54}{space 4}-1.092369{col 67}{space 3}-.2383382
{txt}{space 9}FIN {c |}{col 14}{res}{space 2} -1.45404{col 26}{space 2} .3821293{col 37}{space 1}   -3.81{col 46}{space 3}0.000{col 54}{space 4}   -2.203{col 67}{space 3}-.7050803
{txt}{space 9}BUS {c |}{col 14}{res}{space 2}-.9909812{col 26}{space 2} .2472188{col 37}{space 1}   -4.01{col 46}{space 3}0.000{col 54}{space 4}-1.475521{col 67}{space 3}-.5064412
{txt}{space 9}PER {c |}{col 14}{res}{space 2}-1.089463{col 26}{space 2} .3475729{col 37}{space 1}   -3.13{col 46}{space 3}0.002{col 54}{space 4}-1.770694{col 67}{space 3}-.4082331
{txt}{space 9}ENT {c |}{col 14}{res}{space 2}-.7402256{col 26}{space 2} .4833503{col 37}{space 1}   -1.53{col 46}{space 3}0.126{col 54}{space 4}-1.687575{col 67}{space 3} .2071236
{txt}{space 9}PRO {c |}{col 14}{res}{space 2}-.1294906{col 26}{space 2} .2612204{col 37}{space 1}   -0.50{col 46}{space 3}0.620{col 54}{space 4}-.6414732{col 67}{space 3}  .382492
{txt}{space 8}OCC1 {c |}{col 14}{res}{space 2} -.609936{col 26}{space 2} .2108824{col 37}{space 1}   -2.89{col 46}{space 3}0.004{col 54}{space 4}-1.023258{col 67}{space 3}-.1966142
{txt}{space 8}OCC2 {c |}{col 14}{res}{space 2}-.7956245{col 26}{space 2} .2110245{col 37}{space 1}   -3.77{col 46}{space 3}0.000{col 54}{space 4}-1.209225{col 67}{space 3} -.382024
{txt}{space 8}OCC3 {c |}{col 14}{res}{space 2}-.6922857{col 26}{space 2} .2833784{col 37}{space 1}   -2.44{col 46}{space 3}0.015{col 54}{space 4}-1.247697{col 67}{space 3}-.1368743
{txt}{space 8}OCC4 {c |}{col 14}{res}{space 2}-.2362862{col 26}{space 2} .1800477{col 37}{space 1}   -1.31{col 46}{space 3}0.189{col 54}{space 4}-.5891732{col 67}{space 3} .1166008
{txt}{space 8}OCC5 {c |}{col 14}{res}{space 2}    -.119{col 26}{space 2} .1616701{col 37}{space 1}   -0.74{col 46}{space 3}0.462{col 54}{space 4}-.4358676{col 67}{space 3} .1978675
{txt}{space 8}OCC6 {c |}{col 14}{res}{space 2}-.1631367{col 26}{space 2} .1680094{col 37}{space 1}   -0.97{col 46}{space 3}0.332{col 54}{space 4} -.492429{col 67}{space 3} .1661556
{txt}{space 8}OCC7 {c |}{col 14}{res}{space 2} .0648647{col 26}{space 2} .1724264{col 37}{space 1}    0.38{col 46}{space 3}0.707{col 54}{space 4}-.2730848{col 67}{space 3} .4028141
{txt}{space 8}OCC8 {c |}{col 14}{res}{space 2}-.1874665{col 26}{space 2} .5049165{col 37}{space 1}   -0.37{col 46}{space 3}0.710{col 54}{space 4}-1.177085{col 67}{space 3} .8021516
{txt}{space 8}YEAR {c |}{col 14}{res}{space 2}-.0133445{col 26}{space 2} .0385821{col 37}{space 1}   -0.35{col 46}{space 3}0.729{col 54}{space 4} -.088964{col 67}{space 3} .0622751
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 25.17247{col 26}{space 2} 75.91679{col 37}{space 1}    0.33{col 46}{space 3}0.740{col 54}{space 4}-123.6217{col 67}{space 3} 173.9667
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
    /lnsig2u {c |}{col 14}{res}{space 2}-.1210465{col 26}{space 2} .2940184{col 54}{space 4} -.697312{col 67}{space 3} .4552189
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |}{col 14}{res}{space 2} .9412719{col 26}{space 2} .1383756{col 54}{space 4} .7056358{col 67}{space 3} 1.255595
{txt}         rho {c |}{col 14}{res}{space 2} .4697753{col 26}{space 2}  .073236{col 54}{space 4} .3324085{col 67}{space 3} .6118794
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. outreg2 using state_dependence_test_table, title(Random effect probit with lagged union status) word replace
{txt}{stata `"shellout using `"state_dependence_test_table.rtf"'"':state_dependence_test_table.rtf}
{browse `"D:\Sony\Econometrics\AdvEcon\Exercise6"' :dir}{com} : {txt}{stata `"seeout using "state_dependence_test_table.txt""':seeout}

{com}. * very low p-value for lagged_union. There is state dependence.
. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}D:\Sony\Econometrics\AdvEcon\Exercise6\Exercise6.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}29 Nov 2016, 11:09:18
{txt}{.-}
{smcl}
{txt}{sf}{ul off}